---
kind: property
id: P:Autodesk.Revit.DB.ExportLayerInfo.LayerName
source: html/6b2cbbf8-6f6f-d06a-2b44-2dd34247f410.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.LayerName Property

The layer name stored in value.

## Syntax (C#)
```csharp
public string LayerName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null